print('hi')
#a = 123
#b = 1.223
#c = 'hello'
#print(a)
#print(b)
#print(a, b, c)
#print(f"{a} - {b} - {c}")
#print("{} - {} - {}".format(a,b,c))
#print(type(b))


#print(a)
#print(b)

# n = float(input("Введите число: "))
# print(n * 3)
# print(15 // 5)
# print(15 / 2)
# print(n % 2)

# print(int(5 > 7))
# # Bool
# n = int(input("Число: "))
# if n > 7 and n < 12 or n > 10:
#     print('yes')
# else:
#     print('no')

# n = int(input("Введите число"))
# m = 2700
# print((m + n -1) // n)

# a = 20
# b = 21
# c = 22
# print(((a // 2) + (a % 2)) + ((c // 2) + (c % 2)) + (( b // 2) + (b % 2)))
# print
# print

# i = int(input('Вагон номер который посчитали'))
# j = int(input('Вагон номер поезда п-п'))
# if i == j:
#     print("Доп инфа")
# else:
#     print(i + j -1)

# a = int(input("Введите год: "))
# if a % 4 == 0 and a % 100 != 0 or a % 400 == 0: 
#     print('yes')
# else:
#     print('no')
    
    
#     Найдите сумму цифр трехзначного числа n.
# Результат сохраните в перменную res.
# Пример:
# n = 123 -> res = 6 (1 + 2 + 3)

# n = 123

# print((n // 100) + (n % 100 // 10) + (n % 10))
# first = n // 100
# second = n % 100 // 10
# firdh = n % 10
# sum = first + second + firdh
# res = f"res = {sum} ({first} + {second} + {firdh})" 
# print(res)

# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали n журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# Выведите кортеж из количества журавликов, сделанных Петей, Катей и Сережей.
# n = 6 -> 1 4 1  
# n = 24 -> 4 16 4    
# n = 60 -> 10 40 10 


# P = int(input("ЧИСЛО: "))
# S = P
# K = 2 * (P+S)
# n = K + S + P
# print(n)

# Решение препода
# n1 = n // 6
# n2 = n // 6
# n3 = (n // 6) * 4
# print(n1, n3, n2)

# n = int(input("Введите общее количество журавликов: "))
# if not n % 6:
#    x = n // 6
# print(f'Катя {x * 4} ')
# print(f'Сережа {x} ')
# print(f'Петя {x}')
# n = 6

# # Введите ваше решение ниже
# if not n % 6:
#    x = n // 6
# print(f'{x} {x * 4} {x}')

# Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером.
# Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех.
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6.

# Вам требуется написать программу, которая проверяет счастливость билета с номером n и выводит на экран yes или no.
# n = 385916 -> yes
# n = 123456 -> no

# n = int(input("Введите число"))
# first = n // 100000
# second = n % 100000 // 10000
# firdh = n % 10000 // 1000
# sum = first + second + firdh

# first2 = n % 1000 // 100
# second2 = n % 100 // 10
# firdh2 = n % 10
# sum2 = first2 + second2 + firdh2

# if sum == sum2:
#     print("yes")
# else:
#     print("no")

# Определите, можно ли от шоколадки размером a × b долек отломить c долек,
# если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).
# Выведите yes или no соответственно.

# Пример:


# a, b, c = 3, 2, 4 -> yes
# a, b, c = 3, 2, 1 -> no

# a = 3
# b = 2
# c = 4
# print(c % b)
# print(c % a)
# if c < b * a and (c % b == 0 or c % a == 0):
#     print("yes")
# else:
#     print("no")
    
# if c <= b * a and (c % a == 0 or c % b == 0):
#     print('yes')
# else:
#     print('no')